---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.DuctSizes.GetEnumerator
source: html/02063365-6e18-677d-cf0d-9241dc01e681.htm
---
# Autodesk.Revit.DB.Mechanical.DuctSizes.GetEnumerator Method

Returns an enumerator that iterates through a collection.

## Syntax (C#)
```csharp
public virtual IEnumerator<MEPSize> GetEnumerator()
```

## Returns
An IEnumerator object that can be used to iterate through the collection.